app/controllers/searches_controller.rb

SELECT "factual_data".* FROM "factual_data" WHERE "factual_data"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("commentable_id", "commentable_type", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["commentable_id", 1], ["commentable_type", "FactualData"], ["created_at", Mon, 17 Feb 2014 08:03:21 UTC +00:00], ["updated_at", Mon, 17 Feb 2014 08:03:21 UTC +00:00]]
UPDATE "comments" SET "title" = ?, "comment" = ?, "updated_at" = ? WHERE "comments"."id" = 1  [["title", "Mcdonalds"], ["comment", "fassssssss"], ["updated_at", Mon, 17 Feb 2014 08:03:21 UTC +00:00]]
---
  def create_comment
    factual_data=FactualData.find(params[:id])
    comment =  factual_data.comments.create
    comment.title = factual_data.name
    comment.comment = params[:comment]
    success = comment.save

SELECT "factual_data".* FROM "factual_data" WHERE "factual_data"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show_details
    @search_result=FactualData.find(params[:id])